export const YEARS = [
  {
    year: '',
    position: {x: 0, y: 0},
  },
  {
    year: 1925,
    position: {x: 6921, y: 723},
  },
  {
    year: 1926,
    position: {x: 6921, y: 893},
  },
  {
    year: 1927,
    position: {x: 6921, y: 1198},
  },
  {
    year: 1928,
    position: {x: 6921, y: 2310},
  },
  {
    year: 1929,
    position: {x: 6921, y: 4728},
  },
  {
    year: 1930,
    position: {x: 6921, y: 7179},
  },
  {
    year: 1931,
    position: {x: 6921, y: 11404},
  },
  {
    year: 1932,
    position: {x: 6921, y: 16491},
  },
  {
    year: 1933,
    position: {x: 6921, y: 22276},
  },
  {
    year: 1934,
    position: {x: 6921, y: 28562},
  },
  {
    year: 1935,
    position: {x: 6921, y: 34850},
  },
  {
    year: 1936,
    position: {x: 6921, y: 46060},
  },
  {
    year: 1937,
    position: {x: 6921, y: 57685},
  },
];

export const TROOPS = [
  {
    id: 'placeholder',
    name: '',
    positions: [
      {x1: 0, y1: 0, x2: 0, y2: 0},
    ],
  },
  {
    id: 'front1',
    name: '红一方面军',
    family: true, // 谱系标识
    positions: [
      {x1: 5381, y1: 506, x2: 5381, y2: 722},
      {x1: 5381, y1: 723, x2: 5659, y2: 892},
      {x1: 5381, y1: 893, x2: 5900, y2: 1197},
      {x1: 5332, y1: 1242, x2: 6138, y2: 2339},
      {x1: 5498, y1: 2340, x2: 6297, y2: 4727},
      {x1: 5642, y1: 4728, x2: 6418, y2: 7178},
      {x1: 5642, y1: 7179, x2: 6418, y2: 11403},
      {x1: 5173, y1: 11404, x2: 6418, y2: 16490},
      {x1: 5920, y1: 16491, x2: 6560, y2: 22275},
      {x1: 5742, y1: 22276, x2: 6837, y2: 28561},
      {x1: 5792, y1: 28562, x2: 6638, y2: 34849},
      {x1: 5782, y1: 34850, x2: 6045, y2: 39634},
      {x1: 740, y1: 39635, x2: 1006, y2: 40875},
      {x1: 740, y1: 40876, x2: 1519, y2: 41315},
      {x1: 419, y1: 41575, x2: 694, y2: 43730},
      {x1: 3018, y1: 43731, x2: 3274, y2: 46059},
      {x1: 3018, y1: 46060, x2: 3712, y2: 49690},
      {x1: 3147, y1: 49691, x2: 4127, y2: 51110},
      {x1: 3018, y1: 51111, x2: 3633, y2: 53447},
      {x1: 3018, y1: 53448, x2: 3633, y2: 56333},
      {x1: 3018, y1: 56334, x2: 3267, y2: 57684},
      {x1: 3018, y1: 57685, x2: 3018, y2: 60924},
      {x1: 3686, y1: 60925, x2: 3686, y2: 60925, forceTo: 1937},
    ],
  },
  {
    id: 'front2',
    name: '红二方面军',
    family: true, // 谱系标识
    from: 1936,
    positions: [
      {x1: 3924, y1: 506, x2: 3924, y2: 722},
      {x1: 1441, y1: 50944, x2: 1441, y2: 54370, forceTo: 1936},
      {x1: 1441, y1: 54371, x2: 2023, y2: 55733},
      {x1: 2937, y1: 60925, x2: 2937, y2: 60925, forceTo: 1937},
    ],
  },
  {
    id: 'army2',
    name: '红二军团',
    family: true, // 谱系标识
    from: 1928,
    positions: [
      {x1: 3830, y1: 630, x2: 3830, y2: 722},
      {x1: 3799, y1: 2311, x2: 3799, y2: 4727},
      {x1: 3904, y1: 4728, x2: 3882, y2: 7178},
      {x1: 3904, y1: 7179, x2: 3811, y2: 11403},
      {x1: 3811, y1: 11404, x2: 3811, y2: 11978},
      {x1: 3811, y1: 11979, x2: 3866, y2: 16490, forceTo: 1931},
      {x1: 3866, y1: 16491, x2: 3866, y2: 22275},
      {x1: 3866, y1: 22496, x2: 3870, y2: 28561},
      {x1: 3870, y1: 29748, x2: 3870, y2: 32024, forceTo: 1934},
      {x1: 3870, y1: 32025, x2: 4025, y2: 34849},
      {x1: 4025, y1: 34850, x2: 4025, y2: 35647},
      {x1: 4236, y1: 35648, x2: 4236, y2: 42463},
      {x1: 4025, y1: 42464, x2: 4025, y2: 44008},
      {x1: 4025, y1: 44009, x2: 4025, y2: 44008},
      {x1: 3947, y1: 44164, x2: 3947, y2: 44954},
      {x1: 4236, y1: 44955, x2: 4236, y2: 46059},
      {x1: 4236, y1: 46060, x2: 4236, y2: 47013},
      {x1: 3947, y1: 47014, x2: 3947, y2: 47946},
      {x1: 4236, y1: 47947, x2: 4236, y2: 49781},
      {x1: 1037, y1: 49782, x2: 1037, y2: 50989},
      {x1: 1217, y1: 50990, x2: 1037, y2: 51255},
      {x1: 1185, y1: 54514, x2: 1185, y2: 54686},
      {x1: 2787, y1: 60925, x2: 2787, y2: 60925, forceTo: 1937},
    ],
  },
  {
    id: 'army6',
    name: '红六军团',
    family: true, // 谱系标识
    from: 1927,
    positions: [
      {x1: 4460, y1: 630, x2: 4460, y2: 722},
      {x1: 4512, y1: 2046, x2: 4512, y2: 2222, forceTo: 1927},
      {x1: 4343, y1: 2885, x2: 4343, y2: 6763, forceTo: 1928},
      {x1: 4444, y1: 7512, x2: 4490, y2: 10214, forceTo: 1930},
      {x1: 4490, y1: 10215, x2: 4490, y2: 11403},
      {x1: 4578, y1: 11404, x2: 4578, y2: 13744},
      {x1: 4441, y1: 13745, x2: 4441, y2: 15074},
      {x1: 4382, y1: 15075, x2: 4382, y2: 16490},
      {x1: 4489, y1: 16491, x2: 4489, y2: 21157},
      {x1: 4620, y1: 22125, x2: 4620, y2: 22125, forceTo: 1933},
      {x1: 4489, y1: 22126, x2: 4489, y2: 22275},
      {x1: 4489, y1: 22276, x2: 4489, y2: 24377},
      {x1: 4579, y1: 24378, x2: 4579, y2: 28561},
      {x1: 4579, y1: 28562, x2: 4579, y2: 31057},
      {x1: 4579, y1: 31058, x2: 4579, y2: 33097},
      {x1: 4444, y1: 33098, x2: 4444, y2: 34849},
      {x1: 4444, y1: 34850, x2: 4444, y2: 35820},
      {x1: 4444, y1: 35821, x2: 4444, y2: 42370},
      {x1: 4444, y1: 42371, x2: 4444, y2: 44049},
      {x1: 4462, y1: 44050, x2: 4462, y2: 44929},
      {x1: 4237, y1: 44930, x2: 4237, y2: 46059},
      {x1: 4237, y1: 46060, x2: 4237, y2: 46915},
      {x1: 4476, y1: 46916, x2: 4476, y2: 47930},
      {x1: 4237, y1: 47931, x2: 4237, y2: 49731},
      {x1: 1031, y1: 49732, x2: 1031, y2: 50992},
      {x1: 1659, y1: 50993, x2: 1659, y2: 51428},
      {x1: 1441, y1: 51429, x2: 1441, y2: 54308},
      {x1: 1463, y1: 54309, x2: 1463, y2: 56309},
      {x1: 2892, y1: 56310, x2: 2892, y2: 56920},
      {x1: 3018, y1: 56921, x2: 3018, y2: 57684},
      {x1: 3018, y1: 60925, x2: 3018, y2: 60925, forceTo: 1937},
    ],
  },
  {
    id: 'front4',
    name: '红四方面军',
    family: true, // 谱系标识
    from: 1927,
    positions: [
      {x1: 276, y1: 506, x2: 573, y2: 722},
      {x1: 24, y1: 723, x2: 24, y2: 892},
      {x1: 24, y1: 893, x2: 24, y2: 1999},
      {x1: 480, y1: 2000, x2: 980, y2: 2309},
      {x1: 480, y1: 2310, x2: 980, y2: 5348},
      {x1: 387, y1: 5348, x2: 1142, y2: 7197},
      {x1: 210, y1: 7197, x2: 1142, y2: 11444},
      {x1: 359, y1: 11444, x2: 1142, y2: 16490},
      {x1: 327, y1: 16491, x2: 1142, y2: 22612},
      {x1: 355, y1: 22612, x2: 1337, y2: 27304},
      {x1: 468, y1: 27305, x2: 468, y2: 27368, forceTo: 1934},
      {x1: 100, y1: 27369, x2: 970, y2: 35167},
      {x1: 469, y1: 35167, x2: 1629, y2: 40877},
      {x1: 341, y1: 41310, x2: 1621, y2: 41845},
      {x1: 998, y1: 41845, x2: 1466, y2: 46059},
      {x1: 1038, y1: 46060, x2: 1575, y2: 49057},
      {x1: 894, y1: 49057, x2: 1426, y2: 50200},
      {x1: 532, y1: 50200, x2: 1217, y2: 53887},
      {x1: 993, y1: 53887, x2: 1232, y2: 55646},
      {x1: 2173, y1: 56641, x2: 2545, y2: 58177},
      {x1: 2326, y1: 58806, x2: 2471, y2: 60925, forceTo: 1937},
    ],
  },
  {
    id: 'westroute',
    name: '红西路军',
    family: false, // 无谱系
    from: 1936,
    to: 1937,
    positions: [
      {x1: 674, y1: 53887, x2: 822, y2: 57684, forceTo: 1936},
      {x1: 562, y1: 57685, x2: 1033, y2: 60330},
    ],
  },
  {
    id: 'corps25',
    name: '红二十五军',
    family: true, // 谱系标识
    from: 1932,
    to: 1936,
    positions: [
      {x1: 1917, y1: 630, x2: 1917, y2: 722},
      {x1: 2075, y1: 19566, x2: 1999, y2: 20250, forceTo: 1932},
      {x1: 2192, y1: 20251, x2: 2165, y2: 21550},
      {x1: 2165, y1: 21551, x2: 2191, y2: 22275},
      {x1: 2191, y1: 22276, x2: 2146, y2: 23620},
      {x1: 2146, y1: 23621, x2: 2146, y2: 28561},
      {x1: 2146, y1: 28562, x2: 2146, y2: 29854},
      {x1: 2203, y1: 29855, x2: 2146, y2: 33215, forceTo: 1934},
      {x1: 2203, y1: 33216, x2: 2203, y2: 34849},
      {x1: 2203, y1: 34850, x2: 2203, y2: 35559},
      {x1: 2287, y1: 35560, x2: 2203, y2: 42228, forceTo: 1935},
      {x1: 2203, y1: 42229, x2: 2203, y2: 42470},
      {x1: 2902, y1: 42640, x2: 3018, y2: 44053},
      {x1: 3018, y1: 44054, x2: 3018, y2: 44453, forceTo: 1936},
    ],
  },
  {
    id: 'shanbei',
    name: '陕北红军',
    family: true, // 谱系标识
    from: 1927,
    to: 1936,
    positions: [
      {x1: 2905, y1: 630, x2: 2905, y2: 722},
      {x1: 3129, y1: 1651, x2: 3129, y2: 2274, forceTo: 1927},
      {x1: 3129, y1: 2275, x2: 3129, y2: 3144, forceTo: 1928},
      {x1: 3371, y1: 3145, x2: 3371, y2: 3846},
      {x1: 3213, y1: 12475, x2: 3213, y2: 13303, forceTo: 1931},
      {x1: 2867, y1: 13304, x2: 2867, y2: 14102},
      {x1: 3141, y1: 14103, x2: 3063, y2: 16490},
      {x1: 3063, y1: 16491, x2: 3063, y2: 22275},
      {x1: 3063, y1: 23319, x2: 3063, y2: 28561},
      {x1: 3063, y1: 29017, x2: 3063, y2: 34849},
      {x1: 3063, y1: 35376, x2: 3063, y2: 44053},
      {x1: 3284, y1: 44054, x2: 3284, y2: 44054, forceTo: 1936},
   ],
  },
  {
    id: 'minzhegan',
    name: '闽浙赣红军',
    family: true, // 谱系标识
    from: 1928,
    positions: [
      {x1: 6790, y1: 630, x2: 6790, y2: 722},
      {x1: 6790, y1: 2310, x2: 6790, y2: 4727},
      {x1: 6790, y1: 4970, x2: 6790, y2: 7178},
      {x1: 6790, y1: 7294, x2: 6790, y2: 11666},
      {x1: 6790, y1: 11667, x2: 6790, y2: 16490},
      {x1: 6790, y1: 16950, x2: 6790, y2: 22275},
      {x1: 6790, y1: 22633, x2: 6790, y2: 28561},
      {x1: 6870, y1: 29115, x2: 6733, y2: 34849},
      {x1: 6733, y1: 34850, x2: 6733, y2: 34849},
      {x1: 4336, y1: 60925, x2: 4336, y2: 60925, forceTo: 1937},
    ],
  },
];

export const INTRO = [
  {
    type: 'sub-title',
    line: [
      {
        type: 'plain',
        value: '使用方法'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '● 手指按住屏幕上下左右移动浏览。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '● 双指可动态缩放，倍率在25%到200%之间，'
      },
      {
        type: 'highlight',
        value: '但是体验并不好'
      },
      {
        type: 'plain',
        value: '，仍然推荐使用右上角的缩放面板进行固定倍率的缩放（见下面的说明）。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '● 左下角快捷定位面板：跳到指定年份指定部队在图中的位置。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '● 右上角缩放面板：25%到200%共五档缩放倍率。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '● 右上角帮助面板：显示本帮助、图例、参考资料。'
      }
    ]
  },
  {
    type: 'divider',
    line: []
  },
  {
    type: 'sub-title',
    line: [
      {
        type: 'plain',
        value: '备注'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '1. 本路线图并非完整，部分小根据地或军区单位未列出。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '2. 本路线图的序列粒度最小细化至团级，人事粒度最小细化至师级，中期以后一般未标注团级人事。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '3. 若空间不够则以传统缩写标识：A（集团军、兵团、军团）、C（军）、D（师）、B（旅）、R（团）等。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '4. 部队领导按“军事首长－政治委员（或副军事首长）－参谋长－政治部主任”顺序。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '5. 部分人物未采用当时的名字，而使用建国后更为人熟知的名字，如龚楚（龚鹤村）、李涛（李湘舲）等。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '6. 由于资料和个人水平所限，本路线图可能存在一些错误，以后仍会不断修订完善。'
      }
    ]
  }
];

export const LEGEND = [
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '方框'
      },
      {
        type: 'plain',
        value: '：表示有代表意义的部队（尤其军以上建制部队）。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '左侧浅绿色长条框标示历史时期，右侧浅黄色小框是以年份为单位的时间坐标。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '带箭头线'
      },
      {
        type: 'plain',
        value: '：部队的演变（扩编、缩编、合编、改编、撤编等）。重点部队用加粗箭头表示。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '无箭头线'
      },
      {
        type: 'plain',
        value: '：主要指经历的事件，区别于部队之间的关系。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '虚线'
      },
      {
        type: 'plain',
        value: '：表明不同时期之间的部队沿革，或者是树状图中的虚编制部队。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '叉叉'
      },
      {
        type: 'plain',
        value: '：部队因撤编或被消灭而取消番号。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '树状图'
      },
      {
        type: 'plain',
        value: '：部队的编成详图。在方框内的小型单位有时省略上下级单位间的树状连线。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '双横线'
      },
      {
        type: 'plain',
        value: '：时期或有代表性事件的分界。'
      }
    ]
  },
  {
    type: 'divider',
    line: []
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '圆括号'
      },
      {
        type: 'plain',
        value: '内是部队主要领导者，空间不够时省略圆括号。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '尖括号'
      },
      {
        type: 'plain',
        value: '内是注解（如红军时期区别使用同一番号的两支不同部队）。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '方括号'
      },
      {
        type: 'plain',
        value: '内是经历的历史事件。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'highlight',
        value: '花括号'
      },
      {
        type: 'plain',
        value: '内是部队的编成略图或所辖单位简表（尤其师以下建制部队），是树状图的简化版。'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '其中以逗号（'
      },
      {
        type: 'highlight',
        value: '，'
      },
      {
        type: 'plain',
        value: '）分隔表示不连续的番号，波浪线（'
      },
      {
        type: 'highlight',
        value: '～'
      },
      {
        type: 'plain',
        value: '）分隔表示连续的番号。'
      }
    ]
  }
];

export const REFERENCE = [
  {
    type: 'sub-title',
    line: [
      {
        type: 'plain',
        value: '主要参考资料'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军第一方面军史》，解放军出版社，1993'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军第二方面军战史》，解放军出版社，1992'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军第四方面军战史》，解放军出版社，1989'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军第三军团史》，国防大学出版社，1992'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军第二十五军战史》，解放军出版社，1990'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国人民解放军历史资料丛书·中国人民解放军组织沿革·序列表（1）》，解放军出版社，2002'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国人民解放军历史资料丛书·中国人民解放军组织沿革·单位沿革（1）》，解放军出版社，2007'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国人民解放军历史资料丛书·红军长征：综述·大事记·表册》，解放军出版社，1989'
      }
    ]
  },
  {
    type: 'divider',
    line: []
  },
  {
    type: 'sub-title',
    line: [
      {
        type: 'plain',
        value: '辅助参考资料'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《国民革命军沿革实录》，戚厚杰 等，河北人民出版社，2001'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《国民革命军发展序列》，韦显文 等，解放军出版社，1987'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国现代革命史资料丛刊·南昌起义资料》，人民出版社，1979'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《陕北红军征战纪实》，冯捷，解放军文艺出版社，1996'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《西北革命根据地史》，陕西省委党史研究室，陕西人民出版社，2015'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军西路军》，甘肃人民出版社，2009'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中央革命根据地史料选编》，江西人民出版社，1982'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军第二方面军战史资料选编》，解放军出版社，1995'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《中国工农红军第四方面军战史资料选编》，解放军出版社，1993'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '●《朱毛红军侧记》，萧克，中央党校出版社，1993'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '● 部分人物的年谱、传记、回忆录 等'
      }
    ]
  },
  {
    type: 'line',
    line: [
      {
        type: 'plain',
        value: '● 部分网络资料'
      }
    ]
  }
];